lvx/base/Tasks/бит_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>бит_Задача</Name>
			<Addressing>InformationRegister.бит_ИсполнителиЗадач</Addressing>
			<BasedOn>
				<xr:Item>Document.бит_ФормаВводаБюджета</xr:Item>
				<xr:Item>Document.бит_БюджетнаяОперация</xr:Item>
				<xr:Item>Document.бит_КорректировкаБюджета</xr:Item>
				<xr:Item>Document.бит_АктуализацияБюджета</xr:Item>
				<xr:Item>Document.бит_РаспределениеБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗависимыхОборотов</xr:Item>
				<xr:Item>Document.бит_УстановкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_КорректировкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_ПолучениеФактическихДанных</xr:Item>
				<xr:Item>Document.бит_ОперацияБюджетирование</xr:Item>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
				<xr:Item>Catalog.бит_СтатьиОборотов</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Catalog.бит_НастройкиФормВводаБюджета</xr:Item>
				<xr:Item>Catalog.бит_НастройкиРаспределенияБюджета</xr:Item>
				<xr:Item>Catalog.бит_ЭлементыДанных</xr:Item>
				<xr:Item>Catalog.Подразделения</xr:Item>
				<xr:Item>Document.бит_ДополнительныеУсловияПоДоговору</xr:Item>
				<xr:Item>Document.бит_УстановкаНеснижаемыхОстатков</xr:Item>
				<xr:Item>Document.бит_СведенияОбОстаткахДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаРасходованиеСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Catalog.СценарииПланирования</xr:Item>
				<xr:Item>Document.бит_ПротоколРасхожденийБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗначенийПроизвольныхПараметров</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыВажностиЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Comment>Дата принятия к исполнению</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИсполнения</Name>
					<Comment>Дата начала исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИсполнения</Name>
					<Comment>Дата окончания исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Результат выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Предмет</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПредыдущее</Name>
					<Comment>Состояние предыдущее</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОснование</Name>
					<Comment>Задача основание</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодчиненный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаАлгоритма</Name>
					<Comment>Точка алгоритма</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроверочнаяЗадача</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаПроверку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принято</Name>
							<Comment>Принято</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Comment>Роль исполнителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Comment>Объект адресации № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Comment>Объект адресации № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Comment>Объект адресации № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

lvx/base/InformationRegisters/бит_ИсторияИзмененияСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияИзмененияСтатусовОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Comment>Вид статуса</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Tasks/бит_Задача/Forms/ФормаЗадачи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ТабВрем = Задачи.бит_Задача.КонструкторТаблицаДоступныхДействий();
	
	Для каждого СтрокаТаблицы Из ТабВрем Цикл
		
		НоваяСтрока = ТаблицаДоступныеДействия.Добавить();
		НоваяСтрока.Состояние  = Справочники.бит_СтатусыОбъектов[СтрокаТаблицы.Состояние];
		НоваяСтрока.РольЗадачи = СтрокаТаблицы.РольЗадачи;
		НоваяСтрока.Действие   = Перечисления.бит_ДействияЗадач[СтрокаТаблицы.Действие];
		
	КонецЦикла; 
	
	МаксКоличествоОбъектов = бит_УправлениеПроцессами.МаксимальноеКоличествоОбъектовАдресации();
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПодчиненный) Тогда	
		ПроцессПодчиненный = Задачи.бит_Задача.НайтиПодчиненныйПроцесс(Объект.Ссылка);	
	КонецЕсли; 
	
	ОбновитьКолонкиТаблицыНаПроверку();
	
    УстановитьВидимостьКоманд();
	
	УстановитьВидимость();
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность =
			ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект,
																						ТекущийОбъект,
																						ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если ТекущееДействие = Перечисления.бит_ДействияЗадач.Принять Тогда
		
		Если Задачи.бит_Задача.РазрешеноПринятьКИсполнению(ТекущийОбъект) Тогда			
			ТекущийОбъект.ПринятьКИсполнению();			
		КонецЕсли; 
		
	ИначеЕсли ТекущееДействие = Перечисления.бит_ДействияЗадач.Выполнить Тогда
		
		Если Задачи.бит_Задача.РазрешеноОтметитьВыполнение(ТекущийОбъект) Тогда		
			ТекущийОбъект.ОтметитьВыполнение();		
		КонецЕсли; 
		
	ИначеЕсли ТекущееДействие = Перечисления.бит_ДействияЗадач.Отменить Тогда
		
		Если Задачи.бит_Задача.РазрешеноОтменить(ТекущийОбъект) Тогда			
			ТекущийОбъект.ОтменитьЗадачу();			
		КонецЕсли; 
		
	ИначеЕсли ТекущееДействие = Перечисления.бит_ДействияЗадач.Возобновить Тогда
		
		ТекущийОбъект.ВозобновитьЗадачу();
		
	ИначеЕсли ТекущееДействие = Перечисления.бит_ДействияЗадач.Вернуться Тогда
		
		Если Задачи.бит_Задача.РазрешеноВернуться(ТекущийОбъект) Тогда			
			ТекущийОбъект.Вернуться();			
		КонецЕсли; 
		
	ИначеЕсли ТекущееДействие = Перечисления.бит_ДействияЗадач.Перенаправить Тогда
		
		Задачи.бит_Задача.ПеренаправитьЗадачу(ПараметрыПеренаправления, МаксКоличествоОбъектов, Ложь);		
		ТекущийОбъект.ОтметитьВыполнение(, Истина);
		
	КонецЕсли; 
	
	ТекущееДействие = Перечисления.бит_ДействияЗадач.ПустаяСсылка();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьКолонкиТаблицыНаПроверку();
	
	УстановитьВидимостьКоманд();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьПроцессОЗаписиЗадачи();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаПредметНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Предмет) Тогда	
		 ПоказатьЗначение(,Объект.Предмет);	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОшибкаАвтоНадписьНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Задача", Объект.Ссылка);
	
	ОткрытьФорму("РегистрСведений.бит_ПротоколВыполненияАвтоДействийПроцесса.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаПроверку

&НаКлиенте
Процедура НаПроверкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "НаПроверкуНаДоработку" Тогда
		
		 МассивИД = Новый Массив;
		 МассивИД.Добавить(ВыбраннаяСтрока);
		 ОтправитьНаДоработку(МассивИД);
		 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	// АПК:271-выкл команда подключаемая при наличии подсистемы ИнтеграцияС1СДокументооборотом.
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент =
		ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
	МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда,
																											ЭтотОбъект,
																											Объект);
	// АПК:271-вкл
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

&НаКлиенте
Процедура КомандаПринять(Команда)
	
	ВыполнитьКоманду(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	ВыполнитьКоманду(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренаправить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ФормаПеренаправленияОткрытиеЗавершение", ЭтотОбъект, Новый Структура("ИмяКоманды", Команда.Имя));
	РежимОкна  = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗадачаОснование", Объект.Ссылка);
	ПараметрыФормы.Вставить("Режим", "ИзФормы");
	ОткрытьФорму("Задача.бит_Задача.Форма.ФормаПеренаправленияЗадачи",ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОкна);
	
КонецПроцедуры

// Процедура обработчик оповещения "ФормаПеренаправленияОткрытиеЗавершение".
// 
// Параметры:
//  РезДанные - Структура
//  ДополнительныеДанные - Структура.
// 
&НаКлиенте 
Процедура ФормаПеренаправленияОткрытиеЗавершение(РезДанные, ДополнительныеДанные) Экспорт

	ПараметрыПеренаправления = РезДанные;
	Если ТипЗнч(ПараметрыПеренаправления) = Тип("Структура") Тогда
		
		ВыполнитьКоманду(ДополнительныеДанные.ИмяКоманды);
		
	КонецЕсли; 
	
КонецПроцедуры	// ФормаПеренаправленияОткрытиеЗавершение

&НаКлиенте
Процедура КомандаОтменить(Команда)
	
	ВыполнитьКоманду(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВозобновить(Команда)
	
	ВыполнитьКоманду(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернуться(Команда)
	
	ВыполнитьКоманду(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗадачаНаОсновании(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		РежимОкна  = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗадачаОснование", Объект.Ссылка);
		ОткрытьФорму("Задача.бит_Задача.Форма.ФормаСозданияЗадачи",ПараметрыФормы, ЭтотОбъект,,,,, РежимОкна);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьИсториюСостояний(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Задача", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.Форма.ФормаИсторияСостоянийЗадач",ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтартоватьПодчиненный(Команда)
	
	СтартоватьПодчиненныйПроцесс();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПринятьЗадачи(Команда)
	
	МассивВыделенных = Элементы.НаПроверку.ВыделенныеСтроки;
	
	ПринятьЗадачи(МассивВыделенных);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаДоработку(Команда)
	
	МассивВыделенных = Элементы.НаПроверку.ВыделенныеСтроки;
	
	ОтправитьНаДоработку(МассивВыделенных);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьНаПроверку(Команда)
	
	ОбновитьКолонкиТаблицыНаПроверку();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет команду задачи.
// 
// Параметры:
//  ИмяКоманды - Строка.
// 
&НаКлиенте
Процедура ВыполнитьКоманду(ИмяКоманды)

	Если ВыполнитьКомандуНаСервере(ИмяКоманды) Тогда
		ОповеститьПроцессОЗаписиЗадачи();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьКомандуНаСервере(ИмяКоманды)
	
	ИмяДействия     = СтрЗаменить(ИмяКоманды, "Команда", "");	
	ТекущееДействие = Перечисления.бит_ДействияЗадач[ИмяДействия];	
	
	Если ДоступныеДействия.НайтиПоЗначению(ТекущееДействие) <> Неопределено Тогда
		// Выполняем действие
		Записать();
		Возврат Истина;
	КонецЕсли;
	
	// Действие не доступно
	Возврат Ложь;
	
КонецФункции

// Процедура устанавливает видимость элементов формы. 
// 
&НаСервере
Процедура УстановитьВидимость()
	
	ЕстьНевыполненныеАвтоДействия = Задачи.бит_Задача.ЕстьНевыполненныеАвтоДействия(Объект.Ссылка);
	
	Элементы.Предмет.Видимость 				 = ЗначениеЗаполнено(Объект.Предмет);
	Элементы.НадписьДокументОплаты.Видимость = ЗначениеЗаполнено(ДействиеПериодическогоПлатежа);
	Элементы.ЗадачаОснование.Видимость 		 = ЗначениеЗаполнено(Объект.ЗадачаОснование);
	Элементы.ГруппаПроцессОбщая.Видимость 	 = ЗначениеЗаполнено(Объект.ТочкаАлгоритма);
	
	Элементы.ГруппаПроцессАлгоритмПодчиненный.Видимость = ЗначениеЗаполнено(Объект.АлгоритмПодчиненный);
	Элементы.КомандаСтартоватьПодчиненный.Видимость     = НЕ ПроцессПодчиненный.Стартован;
	
	Элементы.ГруппаНаПроверку.Видимость = Объект.ЭтоПроверочнаяЗадача;
	
	Элементы.НаПроверку.Доступность = НЕ Объект.Выполнена;
	
	Элементы.Виза.Видимость = ЗначениеЗаполнено(Объект.Виза);
	
	Элементы.ГруппаОшибкаАвтоДействий.Видимость = ЕстьНевыполненныеАвтоДействия;
	
КонецПроцедуры // УстановитьВидимость() 

// Процедура заполняет список доступных действий.
// 
&НаСервере
Процедура ОпределитьДоступныеДействия()
	
	ДоступныеДействия.Очистить();
	
	РолиВЗадаче = Задачи.бит_Задача.РольВЗадаче(Объект);
	
	Для каждого Элемент Из РолиВЗадаче Цикл
		
		СтрОтбор = Новый Структура;
		СтрОтбор.Вставить("Состояние", Объект.Состояние);		
		
		Если Элемент.Значение = Истина Тогда			
			СтрОтбор.Вставить("РольЗадачи", Элемент.Ключ);			
		Иначе				
			Продолжить;			
		КонецЕсли; 
		
		НайденныеСтроки = ТаблицаДоступныеДействия.НайтиСтроки(СтрОтбор);
		
		Для каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			
			Если ДоступныеДействия.НайтиПоЗначению(СтрокаТаблицы.Действие) = Неопределено Тогда				
				ДоступныеДействия.Добавить(СтрокаТаблицы.Действие);				
			КонецЕсли; 
			
		КонецЦикла; 		
		
	КонецЦикла; 	
	
КонецПроцедуры // ОпределитьДоступныеДействия()

// Процедура устанавливает видимость команд задачи.
// 
&НаСервере
Процедура УстановитьВидимостьКоманд()

	ОпределитьДоступныеДействия();
	
    Для каждого Действие Из Перечисления.бит_ДействияЗадач Цикл
	
		ДействиеДоступно = ?(ДоступныеДействия.НайтиПоЗначению(Действие) = Неопределено, Ложь, Истина);
		
		ИмяПеречисления = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(Перечисления.бит_ДействияЗадач, Действие);
		ИмяКнопки       = "Команда" + ИмяПеречисления;
		Элементы[ИмяКнопки].Видимость = ДействиеДоступно;
	
	КонецЦикла; 

	Элементы.ГруппаДействияЗадачи.Видимость = НЕ ЗначениеЗаполнено(Объект.АлгоритмПодчиненный);
		
КонецПроцедуры // УстановитьВидимостьКоманд()

// Процедура выполняет старт подчиненного бизнес-процесса. 
// 
&НаСервере
Процедура СтартоватьПодчиненныйПроцесс()

	Если НЕ ЗначениеЗаполнено(ПроцессПодчиненный) Тогда
		
		ПроцессОбъект      = Задачи.бит_Задача.СоздатьПодчиненныйБизнесПроцесс(Объект.Ссылка, Истина, "Все");
		ПроцессПодчиненный = ПроцессОбъект.Ссылка;
		
	ИначеЕсли НЕ ПроцессПодчиненный.Стартован Тогда
		
		ПроцессОбъект = ПроцессПодчиненный.ПолучитьОбъект();
		бит_ОбщегоНазначения.СтартоватьБизнесПроцесс(ПроцессОбъект, "Все");
		
	КонецЕсли; 
	
КонецПроцедуры // СтартоватьПодчиненныйПроцесс()

// Процедура обновляет динамические поля таблицы НаПроверку.
// 
&НаСервере
Процедура ОбновитьКолонкиТаблицыНаПроверку()
	
	Для каждого СтрокаТаблицы Из Объект.НаПроверку Цикл
		СтрокаТаблицы.НаДоработку = НСтр("ru = 'На доработку'; en = 'For rework'");
		СтрокаТаблицы.Состояние = СтрокаТаблицы.Задача.Состояние;
	КонецЦикла; 
	
КонецПроцедуры // ОбновитьКолонкиТаблицыНаПроверку()

// Процедура возвращает задачи, подлежащие проверке, на доработку. 
// 
// Параметры:
//  Массив
// 
&НаСервере
Процедура ОтправитьНаДоработку(МассивИД)
	
	МассивНаДоработку = Новый Массив;	
	
	Для каждого ТекИД Из МассивИД Цикл
		
		ТекущаяСтрока = Объект.НаПроверку.НайтиПоИдентификатору(ТекИД);
		
		Если ТекущаяСтрока <> Неопределено Тогда			
			ТекущаяСтрока.Принято = Ложь;			
			СтрПар = Новый Структура("Задача, Комментарий", ТекущаяСтрока.Задача, ТекущаяСтрока.Комментарий);			
			МассивНаДоработку.Добавить(СтрПар);			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Записать();
	
	Задачи.бит_Задача.НаДоработку(МассивНаДоработку);
	
	Для каждого ТекИД Из МассивИД Цикл
		
		ТекущаяСтрока = Объект.НаПроверку.НайтиПоИдентификатору(ТекИД);
		
		Если ТекущаяСтрока <> Неопределено Тогда			
			ТекущаяСтрока.Состояние = ТекущаяСтрока.Задача.Состояние;			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Задача была изменена из другой задачи при возврате на доработку - обновим данные формы.
	Прочитать();
	УстановитьВидимость();
	УстановитьВидимостьКоманд();
	ОбновитьКолонкиТаблицыНаПроверку();	
	
КонецПроцедуры // ОтправитьНаДоработку()

// Процедура принимает задачи, предназначенные на проверку.
// 
// Параметры:
//  Массив.
// 
&НаСервере
Процедура ПринятьЗадачи(МассивИД)
	
	Для каждого ТекИД Из МассивИД Цикл
		
		ТекущаяСтрока = Объект.НаПроверку.НайтиПоИдентификатору(ТекИД);
		
		Если ТекущаяСтрока <> Неопределено Тогда			
			ТекущаяСтрока.Принято   = Истина;
			ТекущаяСтрока.Состояние = ТекущаяСтрока.Задача.Состояние;			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры // ПринятьЗадачи()

&НаКлиенте
Процедура ОповеститьПроцессОЗаписиЗадачи()
	
	БизнесПроцесс = Объект.БизнесПроцесс;
	Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
		ПараметрыОповещения = Новый Структура("БизнесПроцесс", БизнесПроцесс);
		Оповестить("ИзмененыПараметрыЗадачи", ПараметрыОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
